app/controllers/books_controller.rb

    def create
        @book = Book.new(book_params)
        @book.user_id = current_user.id
        if @book.save
---
INSERT INTO "books" ("title", "opinion", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "作成"], ["opinion", "aaaaa"], ["user_id", 1], ["created_at", "2018-09-27 08:26:18.686966"], ["updated_at", "2018-09-27 08:26:18.686966"]]

    def index
        @books = Book.all
        @book = Book.new
        @user = User.find_by(id: current_user.id)
---
SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def show
        @book = Book.find(params[:id])
        @new_book = Book.new
        @user = User.find_by(id: current_user.id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        book = Book.find(params[:id])
        book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "opinion" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["opinion", "aaaalll"], ["updated_at", "2018-09-28 15:24:19.522017"], ["id", 7]]