app/controllers/books_controller.rb

    def create
        @new_book = Book.new(book_params)
        @new_book.user_id = current_user.id
        @user = current_user
        if @new_book.save
        redirect_to book_path(@book.id), notice: "Create Successfully!"
        else
            @books = Book.all
---
SELECT "books".* FROM "books"