app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
  	@user = User.find(params[:id])
  	@new_book = Book.new
  	@books = @user.books.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "aaaaaaaaaaaaaaaaaaaa"], ["profile_image_id", nil], ["introduction", "kkkkkkkkkkkkkkkkkkkkkkkkkkkkkk"], ["updated_at", "2018-09-28 17:39:48.405308"], ["id", 1]]
---
  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)